БухЭксп/Documents/CW_СписаниеЗатратНЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_СписаниеЗатратНЗП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_НезавершенноеПроизводство</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриложениеКДоговору</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриложениеКДоговоруПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>"Сумма" в базовой валюте учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Comment>"НДС" в базовой валюте учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Comment>"Всего" в базовой валюте учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_Валюта</Name>
							<Comment>"Сумма" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС_Валюта</Name>
							<Comment>"НДС" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_Валюта</Name>
							<Comment>"Всего" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_НезавершенноеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_НезавершенноеПроизводство</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговоруПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВариантУчетаНЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВариантУчетаНЗП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Директивно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_СписаниеЗатратНЗП/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверитьВозмоностьЗаполненияДокумента();
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
КонецПроцедуры  

&НаКлиенте
Процедура Заполнить(Команда)  
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);   
	Если Объект.Состав.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Табличная часть будет очищена. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ПараметрыУчетнойПолитики = CW_Настройки.ПараметрыУчетнойПолитики(Объект.Дата, Объект.Организация);
	Если Не ЗначениеЗаполнено(ПараметрыУчетнойПолитики.НЗППараметрДатаРеализации) Тогда
		ВызватьИсключение "В учетной подлитике не указан параметр ""Дата реализации""";	
	КонецЕсли;
	
	Запрос = Новый Запрос;   
	Запрос.Текст ="ВЫБРАТЬ
	|	ОстаткиНЗП.Организация КАК Организация,
	|	ОстаткиНЗП.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ОстаткиНЗП.Грузоперевозка КАК Грузоперевозка,
	|	ОстаткиНЗП.Контрагент КАК Контрагент,
	|	ОстаткиНЗП.Договор КАК Договор,
	|	ОстаткиНЗП.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	ОстаткиНЗП.ДокументРасходов КАК ДокументРасходов,
	|	ОстаткиНЗП.ПорядокОтражения КАК ПорядокОтражения,
	|	ОстаткиНЗП.СтавкаНДС КАК СтавкаНДС,
	|	ОстаткиНЗП.СпособУчетаНДС КАК СпособУчетаНДС,
	|	ОстаткиНЗП.Номенклатура КАК Номенклатура,
	|	ОстаткиНЗП.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ОстаткиНЗП.Подразделение КАК Подразделение,
	|	ОстаткиНЗП.Валюта КАК Валюта,
	|	ОстаткиНЗП.Покупатель КАК Покупатель,
	|	ОстаткиНЗП.ДоговорПокупателя КАК ДоговорПокупателя,
	|	ОстаткиНЗП.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговоруПокупателя,
	|	ОстаткиНЗП.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиНЗП.СуммаОстаток КАК СуммаОстаток,
	|	ОстаткиНЗП.НДСОстаток КАК НДСОстаток,
	|	ОстаткиНЗП.ВсегоОстаток КАК ВсегоОстаток,
	|	ОстаткиНЗП.Сумма_ВалютаОстаток КАК Сумма_ВалютаОстаток,
	|	ОстаткиНЗП.НДС_ВалютаОстаток КАК НДС_ВалютаОстаток,
	|	ОстаткиНЗП.Всего_ВалютаОстаток КАК Всего_ВалютаОстаток,
	|	ВЫРАЗИТЬ(CW_ХарактеристикиГрузоперевозок.Значение КАК ДАТА) КАК ЗначениеПараметра
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.CW_НезавершенноеПроизводство.Остатки(
	|		&Период, 
	|		Организация = &Организация
	|		//УСЛОВИЕ_Подразделение
	|									) КАК ОстаткиНЗП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	|		ПО ОстаткиНЗП.Грузоперевозка = CW_ХарактеристикиГрузоперевозок.Грузоперевозка
	|			И (CW_ХарактеристикиГрузоперевозок.Параметр = &ПараметрДатаРеализации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Организация КАК Организация,
	|	ВТ_Остатки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ВТ_Остатки.Грузоперевозка КАК Грузоперевозка,
	|	ВТ_Остатки.Контрагент КАК Контрагент,
	|	ВТ_Остатки.Договор КАК Договор,
	|	ВТ_Остатки.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	ВТ_Остатки.ДокументРасходов КАК ДокументРасходов,
	|	ВТ_Остатки.ПорядокОтражения КАК ПорядокОтражения,
	|	ВТ_Остатки.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_Остатки.СпособУчетаНДС КАК СпособУчетаНДС,
	|	ВТ_Остатки.Номенклатура КАК Номенклатура,
	|	ВТ_Остатки.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_Остатки.Подразделение КАК Подразделение,
	|	ВТ_Остатки.Валюта КАК Валюта,
	|	ВТ_Остатки.Покупатель КАК Покупатель,
	|	ВТ_Остатки.ДоговорПокупателя КАК ДоговорПокупателя,
	|	ВТ_Остатки.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговоруПокупателя,
	|	ВТ_Остатки.КоличествоОстаток КАК Количество,
	|	ВТ_Остатки.СуммаОстаток КАК Сумма,
	|	ВТ_Остатки.НДСОстаток КАК НДС,
	|	ВТ_Остатки.ВсегоОстаток КАК Всего,
	|	ВТ_Остатки.Сумма_ВалютаОстаток КАК Сумма_Валюта,
	|	ВТ_Остатки.НДС_ВалютаОстаток КАК НДС_Валюта,
	|	ВТ_Остатки.Всего_ВалютаОстаток КАК Всего_Валюта
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|ГДЕ
	|	ВТ_Остатки.ЗначениеПараметра <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВТ_Остатки.ЗначениеПараметра <= &Период";	

	
	ЭтоВерсияКОРП = ВариантыПриложений.ЭтоВерсияКОРП();
	Если ЭтоВерсияКОРП Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УСЛОВИЕ_Подразделение", "И ПодразделениеОрганизации = &ПодразделениеОрганизации");
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Период",						Объект.Дата);
	Запрос.УстановитьПараметр("Организация",				Объект.Организация);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации",	Объект.ПодразделениеОрганизации); 
	Запрос.УстановитьПараметр("ПараметрДатаРеализации",		ПараметрыУчетнойПолитики.НЗППараметрДатаРеализации); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Состав.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры   

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере() 
	
	ПроверитьВозмоностьЗаполненияДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозмоностьЗаполненияДокумента()
	
	Дата = ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата);
	
	ПараметрыУчетнойПолитики		= CW_Настройки.ПараметрыУчетнойПолитики(Дата, Объект.Организация);  
	ВариантУчетаНЗПУчетнойПолитики	= ПараметрыУчетнойПолитики["ВариантУчетаНЗП"];
	
	ОтключеноУчетнойПолитикой = Ложь;
	
	ЧастиЗаголовка = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Организация) 
		И ВариантУчетаНЗПУчетнойПолитики <> ПредопределенноеЗначение("Перечисление.CW_ВариантУчетаНЗП.Автоматически") Тогда 
		
		КлючЗаписи = ПолучитьКлючЗаписи(ПараметрыУчетнойПолитики["Период"]);
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(КлючЗаписи);
		
		ЧастиЗаголовка.Добавить(
		НСтр("ru = 'Редактирование документа невозможно: ведение автоматического учета незавершенного производства отключено в <a href = """+СокрЛП(НавигационнаяСсылка)+""">учетной политике</a>.'"));
		
		ОтключеноУчетнойПолитикой = Истина;
		
	КонецЕсли;
	
	Элементы.ОтключеноУчетнойПолитикой.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(СтрСоединить(ЧастиЗаголовка));
	Элементы.ОтключеноУчетнойПолитикой.Видимость = ОтключеноУчетнойПолитикой;
	Элементы.Состав.Доступность 				 = НЕ ОтключеноУчетнойПолитикой;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписи(Знач Период)
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("Период", 		Период);
	ЗначенияКлюча.Вставить("Организация", 	Объект.Организация);
	
	Возврат РегистрыСведений.CW_УчетнаяПолитика.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции
